//---------------------------------------------------------------------------
//                 Реализация библиотеки для моделирования 
//                  гидродинамических и русловых процессов
//---------------------------------------------------------------------------
//                Модуль BedLoadLib для расчета донных деформаций 
//                 (учет движения только влекомых наносов)
//         по русловой модели Петрова А.Г. и Потапова И.И. от 2014 г.
//                          Потапов И.И. 27.12.19
//---------------------------------------------------------------------------
//                          08.01.24 Потапов И.И.
//---------------------------------------------------------------------------
//                   рефакторинг : Потапов И.И.
//                          27.04.25
//---------------------------------------------------------------------------
namespace BedLoadLib
{
    using System;
    using CommonLib;
    /// <summary>
    /// ОО: Параметры задачи используемые при 
    /// расчете донных деформаций
    /// </summary>
    [Serializable]
    public class BedLoadParams2DFEM : ABedLoadParams, ITProperty<BedLoadParams2D>
    {
        /// <summary>
        /// Значение параметров по умолчанию
        /// </summary>
        public BedLoadParams2DFEM() : base() { }
        /// <summary>
        /// Конструктор копирования
        /// </summary>
        /// <param name="p"></param>
        public BedLoadParams2DFEM(BedLoadParams2D p)
        {
            SetParams(p);
        }
        public BedLoadParams2D Clone(BedLoadParams2D p)
        {
            return new BedLoadParams2D(p);
        }
    }
}

