//---------------------------------------------------------------------------
//                          ПРОЕКТ  "МКЭ"
//                         проектировщик:
//                           Потапов И.И.
//---------------------------------------------------------------------------
//                 кодировка : 11.09.2021 Потапов И.И.
//---------------------------------------------------------------------------
namespace MeshLib.ATable
{
    /// <summary>
    ///  Маски неизвестных в узле 
    /// </summary>
    interface ITablKnot
    {
        /// <summary>
        /// Вектор наличия неизвестной в узле 0 или 1
        /// </summary>
        uint[] Mask { get; }
    }
}
