//---------------------------------------------------------------------------
//                    ПРОЕКТ  "РУСЛОВЫЕ ПРОЦЕССЫ"
//                         проектировщик:
//                           Потапов И.И.
//---------------------------------------------------------------------------
//                 кодировка : 07.02.2024 Потапов И.И.
//---------------------------------------------------------------------------
//                      Сбока No Property River Lib
//              с убранными из наследников Property классами 
//---------------------------------------------------------------------------
namespace NPRiverLib
{

    public class RiverError
    {
        /// <summary>
        /// Имя ошибки
        /// </summary>
        /// <param name="flagErr"></param>
        /// <returns></returns>
        public static string ErrorName(int flagErr)
        {
            string s = "Ошибка при расчете ";
            string[] ErrName = { s + "сободной поверхности: CalkWaterLevel",
                                 s + "построение КЭ сетки: CreateCalculationDomain",
                                 s + "скоростей потока: SolveVelosity",
                                 s + "придонных касательных напряжений: TausToVols" };
            return ErrName[flagErr];
        }
    }
}
