//---------------------------------------------------------------------------
//              Реализация библиотеки для моделирования 
//               гидродинамических и русловых процессов
//                      - (C) Copyright 2021 -
//                       ALL RIGHT RESERVED
//                        ПРОЕКТ "BLLib"
//---------------------------------------------------------------------------
//                   разработка: Потапов И.И.
//                          19.12.2021
//---------------------------------------------------------------------------
namespace BLLib
{
    using System;
    /// <summary>
    /// Флаг обрушения в плановых лавинных моделях
    /// </summary>
    [Serializable]
    public enum DirectAvalanche
    {
        /// <summary>
        ///  обруение по направлению Х
        /// </summary>
        AvalancheX,
        /// <summary>
        ///  обруение по направлению Y
        /// </summary>
        AvalancheY,
        /// <summary>
        ///  обруение по направлениям Х и у
        /// </summary>
        AvalancheXY
    }
}
