//---------------------------------------------------------------------------
//   Реализация библиотеки методов решения систем алгебраических уравнений
//                     - (C) Copyright 2021 -
//                       ALL RIGHT RESERVED
//                    разработка: Потапов И.И.
//---------------------------------------------------------------------------
//                        Потапов И.И.
//                         05.08.2021 
//---------------------------------------------------------------------------

namespace AlgebraLib
{
    /// <summary>
    /// ОО: Используется для хранения разреженных матриц формате CRS
    /// </summary>
    public class SparseElementIndex
    {
        /// <summary>
        /// индекс строки которая имеет не нулевой элемент в данном столбце
        /// </summary>
        public int Knot;
        /// <summary>
        /// индекс элемента в упакованной строке матрицы
        /// </summary>
        public int j;
        public SparseElementIndex(int Knot, int j)
        {
            this.Knot = Knot;
            this.j = j;
        }
    }
}
