//---------------------------------------------------------------------------
//                    ПРОЕКТ  "РУСЛОВЫЕ ПРОЦЕССЫ"
//                         проектировщик:
//                           Потапов И.И.
//---------------------------------------------------------------------------
//               Реверс в NPRiverLib 20.01.2025 Потапов И.И.
//---------------------------------------------------------------------------
namespace FEMTasksLib.AllWallFunctions
{
    public interface IWallFunction
    {
        /// <summary>
        /// Функция стенки для турбулентных моделей
        /// </summary>
        /// <param name="Ux">проекция скорости в центре пристеночной ячейке
        /// на плоскость касательную к стенке</param>
        /// <param name="y">расстояние от центра ячейки до стенки</param>
        /// <param name="tau">касательное напряжение на стенке</param>
        /// <param name="y_plus">безразмерное расстояние от центра ячейки до стенки</param>
        void Tau_wall(ref double y_plus, ref double u_plus, ref double tau, 
                          double Ux, double y, double ks = 0);
        /// <summary>
        /// Пример работы и тест
        /// </summary>
        void tau_wall_test();
    }
}
