//---------------------------------------------------------------------------
//                          ПРОЕКТ  "DISER"
//                  создано  :   9.03.2007 Потапов И.И.
//---------------------------------------------------------------------------
//                    ПРОЕКТ  "РУСЛОВЫЕ ПРОЦЕССЫ"
//            перенесено с правкой : 06.12.2020 Потапов И.И. 
//---------------------------------------------------------------------------
//               Реверс в NPRiverLib 09.02.2024 Потапов И.И.
//---------------------------------------------------------------------------
namespace NPRiverLib.APRiver_1YD.Params
{
    using System;
    using System.ComponentModel;

    [Serializable]
    public enum TaskVariant
    {
        /// <summary>
        /// Заданна функция расхода при вычисляемой функции свободной поверхности
        /// </summary>
        [Description("Заданна функция расхода")]
        flowRateFun = 0,
        /// <summary>
        /// Заданна функция свободной поверхности при вычисляемой функции расхода 
        /// </summary>
        [Description("Заданна функция свободной поверхности")]
        WaterLevelFun
    }
}
