//---------------------------------------------------------------------------
//                    ПРОЕКТ  "РУСЛОВЫЕ ПРОЦЕССЫ"
//                         проектировщик:
//                           Потапов И.И.
//---------------------------------------------------------------------------
//                 кодировка : 10.08.2021 Потапов И.И.
//---------------------------------------------------------------------------
//             обновление и чистка : 01.01.2024 Потапов И.И.
//---------------------------------------------------------------------------
namespace TriMeshGeneratorLib
{
    /// <summary>
    /// Классический двусвязный список
    /// </summary>
    public class RVItem : IRVItem
    {
        /// <summary>
        /// идентификационный номер
        /// </summary>
        public int ID { get; set; }
        /// <summary>
        /// Позиция индекса элемента (позиция в списке)
        /// </summary>
        public int Index { get; set; }
        /// <summary>
        /// Указатель на следующий элемент в списке
        /// </summary>
        public RVItem Next { get; set; }
        /// <summary>
        /// Указатель на предыдущий элемент в списке
        /// </summary>
        public RVItem Prev { get; set; }
        public RVItem(int id = 1, RVItem next = null, RVItem prev = null, int ind = -1)
        {
            ID = id;
            Next = next;
            Prev = prev;
            Index = ind;
        }
    }
}
