//---------------------------------------------------------------------------
//                    ПРОЕКТ  "РУСЛОВЫЕ ПРОЦЕССЫ"
//                         проектировщик:
//                           Потапов И.И.
//---------------------------------------------------------------------------
//                 кодировка : 11.08.2021 Потапов И.И.
//---------------------------------------------------------------------------
//             обновление и чистка : 01.01.2024 Потапов И.И.
//---------------------------------------------------------------------------


namespace TriMeshGeneratorLib
{
    /// <summary>
    /// Класс точка унаследован от RVItem, поэтому его можно указать в списке ссылок.
    /// </summary>
    public class RVPoint : RVItem
    {
        /// <summary>
        /// Координата х точки
        /// </summary>
        public double X { get => x; set => x = value; }
        /// <summary>
        /// Координата y точки
        /// </summary>
        public double Y { get => y; set => y = value; }

        protected double x;           
        protected double y;           
        public RVPoint(int id = 1, double xcoord = 10.0, double ycoord = 10.0) : base(id)
        {
            x = xcoord;
            y = ycoord;
        }
    }
}
