//---------------------------------------------------------------------------
//                    ПРОЕКТ  "РУСЛОВЫЕ ПРОЦЕССЫ"
//                         проектировщик:
//                           Потапов И.И.
//---------------------------------------------------------------------------
//                 кодировка : 07.02.2024 Потапов И.И.
//---------------------------------------------------------------------------
//                      Сбока No Property River Lib
//              с убранными из наследников Property классами 
//---------------------------------------------------------------------------
namespace CommonLib
{
    using System;
    /// <summary>
    /// Состояние задачи
    /// </summary>
    [Serializable]
    public enum ETaskStatus
    {
        /// <summary>
        /// Задача создана
        /// </summary>
        TaskNoReady = 0,
        /// <summary>
        /// Выделена память под рабочие массивы 
        /// </summary>
        AllocMassives,
        /// <summary>
        /// Загруженные параметры задачи
        /// </summary>
        LoadParamsData,
        /// <summary>
        /// Загруженные данные для расчетной области
        /// </summary>
        LoadAreaData,
        /// <summary>
        /// Создана расчетная область 
        /// </summary>
        CreateMesh,
        /// <summary>
        /// Задача готова к решению
        /// </summary>
        TaskReady
    }


}