//---------------------------------------------------------------------------
//                   ПРОЕКТ  "Русловые процессы"
//                         проектировщик:
//                           Потапов И.И.
//---------------------------------------------------------------------------
//              кодировка : 11.09.2023 Потапов И.И.
//---------------------------------------------------------------------------
namespace ConnectLib
{
    /// <summary>
    /// Тип возвращаемой комманды
    /// </summary>
    public enum TypeCommand
    {
        insert,
        update,
        delete
    }

    /// <summary>
    /// Стандарт для генерации строки комманды
    /// </summary>
    public interface IStandartSQLCommand
    {
        /// <summary>
        /// Возвращает запрос на вставку записи еслм ID == -1
        /// или на обновление в противном случае
        /// </summary>
        /// <param name="id"></param>
        /// <returns></returns>
        string GetCommand(TypeCommand com);
    }
}
