//---------------------------------------------------------------------------
//                          ПРОЕКТ  "МКЭ"
//                         проектировщик:
//                           Потапов И.И.
//---------------------------------------------------------------------------
//                 кодировка : 11.09.2021 Потапов И.И.
//---------------------------------------------------------------------------
namespace MeshLib.ATable
{
    interface IAdressUnknow
    {
        /// <summary>
        /// номер узла для определения координат
        /// </summary>
        uint Node { get; set; }
        /// <summary>
        /// номер маски (неизесной) в таблице смещений
        /// </summary>
        uint Mask { get; set; }
    }
}
