//---------------------------------------------------------------------------
//                          ПРОЕКТ  "МКЭ"
//                         проектировщик:
//                           Потапов И.И.
//---------------------------------------------------------------------------
//                 кодировка : 11.09.2021 Потапов И.И.
//---------------------------------------------------------------------------
namespace MeshLib.ATable
{
    using CommonLib;
    /// <summary>
    /// Конечный элемент/адресная таблица
    /// </summary>
    interface IElements
    {
        /// <summary>
        /// Номера узлов на конечном элементе или 
        /// неизвестных в адресной таблице
        /// </summary>
        uint[] Vertex { get; set; }
        /// <summary>
        /// Тип функции формы используемой для этого элемента
        /// </summary>
        TypeFunForm TFunForm { get; set; }
    }
}
